mediaMicroservices/wrk2/outs/c10_r10.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 10 connections
  Thread calibration: mean lat.: 9.434ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 10.240ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.200ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.933ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.15ms    2.32ms  22.14ms   90.00%
    Req/Sec     2.07      9.13    41.00     95.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.66ms
 75.000%    9.54ms
 90.000%   11.05ms
 99.000%   22.14ms
 99.900%   25.87ms
 99.990%   25.87ms
 99.999%   25.87ms
100.000%   25.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.327     0.000000            1         1.00
       7.487     0.100000           41         1.11
       7.899     0.200000           82         1.25
       8.191     0.300000          123         1.43
       8.415     0.400000          164         1.67
       8.663     0.500000          206         2.00
       8.783     0.550000          226         2.22
       8.943     0.600000          246         2.50
       9.111     0.650000          267         2.86
       9.327     0.700000          287         3.33
       9.543     0.750000          308         4.00
       9.639     0.775000          318         4.44
       9.815     0.800000          328         5.00
       9.999     0.825000          339         5.71
      10.199     0.850000          349         6.67
      10.479     0.875000          359         8.00
      10.687     0.887500          364         8.89
      11.047     0.900000          369        10.00
      11.247     0.912500          375        11.43
      11.519     0.925000          380        13.33
      11.807     0.937500          385        16.00
      11.815     0.943750          387        17.78
      12.375     0.950000          390        20.00
      13.007     0.956250          393        22.86
      13.159     0.962500          395        26.67
      13.791     0.968750          398        32.00
      14.271     0.971875          399        35.56
      14.367     0.975000          400        40.00
      15.175     0.978125          402        45.71
      15.255     0.981250          403        53.33
      16.295     0.984375          404        64.00
      18.559     0.985938          405        71.11
      18.559     0.987500          405        80.00
      22.143     0.989062          406        91.43
      23.791     0.990625          407       106.67
      23.791     0.992188          407       128.00
      25.567     0.992969          408       142.22
      25.567     0.993750          408       160.00
      25.567     0.994531          408       182.86
      25.695     0.995313          409       213.33
      25.695     0.996094          409       256.00
      25.695     0.996484          409       284.44
      25.695     0.996875          409       320.00
      25.695     0.997266          409       365.71
      25.871     0.997656          410       426.67
      25.871     1.000000          410          inf
#[Mean    =        9.145, StdDeviation   =        2.323]
#[Max     =       25.856, Total count    =          410]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  501 requests in 1.00m, 90.87KB read
  Socket errors: connect 0, read 0, write 0, timeout 27
  Non-2xx or 3xx responses: 5
Requests/sec:      8.35
Transfer/sec:      1.51KB