mediaMicroservices/wrk2/outs/c10_r2000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 10 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    46.16s     3.41s    0.87m    67.45%
    Req/Sec    39.61     70.30   222.00     82.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   46.43s 
 75.000%   48.23s 
 90.000%   50.56s 
 99.000%    0.87m 
 99.900%    0.87m 
 99.990%    0.87m 
 99.999%    0.87m 
100.000%    0.87m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000            4         1.00
   41615.359     0.100000          767         1.11
   43188.223     0.200000         1515         1.25
   44761.087     0.300000         2256         1.43
   45711.359     0.400000         3039         1.67
   46432.255     0.500000         3767         2.00
   46858.239     0.550000         4153         2.22
   47218.687     0.600000         4529         2.50
   47546.367     0.650000         4915         2.86
   47874.047     0.700000         5266         3.33
   48234.495     0.750000         5649         4.00
   48529.407     0.775000         5836         4.44
   48955.391     0.800000         6029         5.00
   49315.839     0.825000         6206         5.71
   49676.287     0.850000         6403         6.67
   50069.503     0.875000         6596         8.00
   50298.879     0.887500         6680         8.89
   50561.023     0.900000         6784        10.00
   50757.631     0.912500         6874        11.43
   50954.239     0.925000         6969        13.33
   51118.079     0.937500         7051        16.00
   51216.383     0.943750         7098        17.78
   51347.455     0.950000         7159        20.00
   51445.759     0.956250         7203        22.86
   51511.295     0.962500         7239        26.67
   51642.367     0.968750         7297        32.00
   51675.135     0.971875         7312        35.56
   51740.671     0.975000         7337        40.00
   51806.207     0.978125         7356        45.71
   51871.743     0.981250         7384        53.33
   51937.279     0.984375         7407        64.00
   51970.047     0.985938         7418        71.11
   52002.815     0.987500         7431        80.00
   52035.583     0.989062         7441        91.43
   52068.351     0.990625         7451       106.67
   52101.119     0.992188         7463       128.00
   52133.887     0.992969         7473       142.22
   52133.887     0.993750         7473       160.00
   52166.655     0.994531         7480       182.86
   52199.423     0.995313         7489       213.33
   52232.191     0.996094         7497       256.00
   52232.191     0.996484         7497       284.44
   52232.191     0.996875         7497       320.00
   52264.959     0.997266         7505       365.71
   52264.959     0.997656         7505       426.67
   52297.727     0.998047         7509       512.00
   52297.727     0.998242         7509       568.89
   52297.727     0.998437         7509       640.00
   52330.495     0.998633         7514       731.43
   52330.495     0.998828         7514       853.33
   52330.495     0.999023         7514      1024.00
   52330.495     0.999121         7514      1137.78
   52363.263     0.999219         7518      1280.00
   52363.263     0.999316         7518      1462.86
   52363.263     0.999414         7518      1706.67
   52363.263     0.999512         7518      2048.00
   52363.263     0.999561         7518      2275.56
   52363.263     0.999609         7518      2560.00
   52363.263     0.999658         7518      2925.71
   52363.263     0.999707         7518      3413.33
   52396.031     0.999756         7520      4096.00
   52396.031     1.000000         7520          inf
#[Mean    =    46162.644, StdDeviation   =     3413.126]
#[Max     =    52363.264, Total count    =         7520]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7521 requests in 1.00m, 1.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 117
  Non-2xx or 3xx responses: 853
Requests/sec:    125.30
Transfer/sec:     24.92KB