mediaMicroservices/wrk2/outs/c10_r250.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 10 connections
  Thread calibration: mean lat.: 19.654ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 17.464ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 31.410ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 25.549ms, rate sampling interval: 105ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.46s     9.47s   21.35s    66.86%
    Req/Sec    36.79     36.28   125.00     82.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.74s 
 75.000%   20.35s 
 90.000%   20.76s 
 99.000%   21.35s 
 99.900%   21.45s 
 99.990%   21.46s 
 99.999%   21.48s 
100.000%   21.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.979     0.000000            1         1.00
      13.351     0.100000          740         1.11
      31.247     0.200000         1480         1.25
      96.639     0.300000         2219         1.43
   19234.815     0.400000         2960         1.67
   19742.719     0.500000         3719         2.00
   19890.175     0.550000         4071         2.22
   20054.015     0.600000         4463         2.50
   20152.319     0.650000         4827         2.86
   20267.007     0.700000         5247         3.33
   20348.927     0.750000         5572         4.00
   20398.079     0.775000         5751         4.44
   20447.231     0.800000         5929         5.00
   20512.767     0.825000         6134         5.71
   20594.687     0.850000         6295         6.67
   20676.607     0.875000         6497         8.00
   20725.759     0.887500         6605         8.89
   20758.527     0.900000         6689        10.00
   20807.679     0.912500         6762        11.43
   20873.215     0.925000         6850        13.33
   20938.751     0.937500         6944        16.00
   20971.519     0.943750         6981        17.78
   21037.055     0.950000         7029        20.00
   21086.207     0.956250         7084        22.86
   21135.359     0.962500         7120        26.67
   21184.511     0.968750         7168        32.00
   21200.895     0.971875         7188        35.56
   21217.279     0.975000         7213        40.00
   21250.047     0.978125         7235        45.71
   21282.815     0.981250         7266        53.33
   21299.199     0.984375         7283        64.00
   21315.583     0.985938         7308        71.11
   21315.583     0.987500         7308        80.00
   21331.967     0.989062         7320        91.43
   21348.351     0.990625         7341       106.67
   21348.351     0.992188         7341       128.00
   21364.735     0.992969         7348       142.22
   21381.119     0.993750         7361       160.00
   21381.119     0.994531         7361       182.86
   21397.503     0.995313         7370       213.33
   21397.503     0.996094         7370       256.00
   21397.503     0.996484         7370       284.44
   21413.887     0.996875         7379       320.00
   21413.887     0.997266         7379       365.71
   21413.887     0.997656         7379       426.67
   21430.271     0.998047         7384       512.00
   21430.271     0.998242         7384       568.89
   21446.655     0.998437         7393       640.00
   21446.655     0.998633         7393       731.43
   21446.655     0.998828         7393       853.33
   21446.655     0.999023         7393      1024.00
   21446.655     0.999121         7393      1137.78
   21446.655     0.999219         7393      1280.00
   21446.655     0.999316         7393      1462.86
   21446.655     0.999414         7393      1706.67
   21446.655     0.999512         7393      2048.00
   21446.655     0.999561         7393      2275.56
   21463.039     0.999609         7395      2560.00
   21463.039     0.999658         7395      2925.71
   21463.039     0.999707         7395      3413.33
   21463.039     0.999756         7395      4096.00
   21463.039     0.999780         7395      4551.11
   21463.039     0.999805         7395      5120.00
   21463.039     0.999829         7395      5851.43
   21463.039     0.999854         7395      6826.67
   21479.423     0.999878         7396      8192.00
   21479.423     1.000000         7396          inf
#[Mean    =    13455.057, StdDeviation   =     9465.337]
#[Max     =    21463.040, Total count    =         7396]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9888 requests in 1.00m, 1.78MB read
  Non-2xx or 3xx responses: 253
Requests/sec:    164.80
Transfer/sec:     30.33KB